Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.CADLink Property
 An external resource type representing CAD Links data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType CADLink { get; }
Public Shared ReadOnly Property CADLink As ExternalResourceType
	Get
public:
static property ExternalResourceType^ CADLink {
	ExternalResourceType^ get ();
}
static member CADLink : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace